<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use Illuminate\Support\Str;

class MorphController extends Controller
{
    //

    public function index()
    {
      $s1 = '';
      return view('Morph.index',compact('s1'));
    }

    public function Analysis(Request $request)
    {
      $koren_osnova =['ача'=>['koren'=>'ача','osnova'=>'ача','chrechi'=>'существительное']];
      $affiks = ['сем'=>['affiks'=>'сем','poyasnenie'=>'аффикс множественного числа'],
                 'сам'=>['affiks'=>'сам','poyasnenie'=>'аффикс множественного числа'],];
      $Leksema = $request->input('Leksema');
      //  dump($autor); 
        $s1 =  $Leksema . '- анализ слова';

        $string = 'Hello, world!';
        $substring = 'world';
        
        $position = Str::position($string, $substring);
         
        dump($position);

        return view('Morph.index', compact('s1'));
    }

//Метод Arr::sort сортирует массив по его значениям:
// Метод Arr::sortDesc сортирует массив в порядке убывания его значений:
//Метод Arr::wrap помещает заданное значение в массив.
//Функция data_get извлекает значение из вложенного массива или объекта, используя "точку" обозначение:
//Str::after()
// Метод Str::after возвращает в строке все, что находится после заданного значения. Вся строка будет возвращена, если значение не существует в строке:
//Str::afterLast()
//Метод Str::afterLast возвращает все данные после последнего вхождения заданного значения в строку. Вся строка будет возвращена, если значение не существует в строке:
//Str::before()
//Метод Str::before возвращает в строке все, что находится до заданного значения:
 // Str::beforeLast()
 // Метод Str::beforeLast возвращает все, что находится до последнего вхождения данного значения в строку:
 // Str::between()
 // Метод Str::between возвращает часть строки между двумя значениями:
//  Str::betweenFirst()
//  Метод Str::betweenFirst возвращает наименьшую возможную часть строки между двумя значениями:
//  Str::contains()
//  Метод Str::contains определяет, содержит ли данная строка заданное значение. Этот метод чувствителен к регистру:
//  Вы также можете передать массив значений, чтобы определить, содержит ли данная строка какое-либо значение из массива:
//Str::containsAll()
//Метод Str::containsAll определяет, содержит ли данная строка все значения в заданном массиве:
//Str::endsWith()
//Метод Str::endsWith определяет, заканчивается ли данная строка заданным значением:
//Вы также можете передать массив значений, чтобы определить, заканчивается ли данная строка каким-либо значением в массиве:
//Str::headline()
//Метод Str::headline преобразует строки, разделенные регистром, дефисами или символами подчеркивания, в строку, разделенную пробелами, в которой первая буква каждого слова пишется с заглавной буквы:
//Str::is()
//Метод Str::is определяет, соответствует ли данная строка заданному шаблону. В качестве подстановочных значений можно использовать звездочки:
//Str::length()
//Метод Str::length возвращает длину заданной строки:
//Str::limit()
//Метод Str::limit усекает заданную строку до указанной длины:
//Str::remove()
//Метод Str::remove удаляет заданное значение или массив значений из строки:
//Str::squish()
//Метод Str::squish удаляет из строки все лишние пробелы, включая лишние пробелы между словами:

//Str::startsWith()
//Метод Str::startsWith определяет, начинается ли данная строка с заданного значения:
//Str::substr()
//Метод Str::substr возвращает часть строки, указанную параметрами начала и длины:

//Str::substrCount()
//Метод Str::substrCount возвращает количество вхождений заданного значения в заданную строку:

//Str::wordCount()
//Метод Str::wordCount возвращает количество слов, содержащихся в строке:

//after
//Метод after возвращает в строке все, что находится после заданного значения. Вся строка будет возвращена, если значение не существует в строке:
// afterLast
// Метод afterLast возвращает все данные после последнего вхождения заданного значения в строку. Вся строка будет возвращена, если значение не существует в строке:

// append
// Метод append добавляет заданные значения в строку:
// before
// Метод before возвращает в строке все, что находится до заданного значения:

//   contains
//   Метод contains определяет, содержит ли данная строка заданное значение. Этот метод чувствителен к регистру:

//   containsAll
//   Метод containsAll определяет, содержит ли данная строка все значения в данном массиве:

//   endsWith
//   Метод endsWith определяет, заканчивается ли данная строка заданным значением:

//   exactly
//   Метод exactly определяет, соответствует ли данная строка точной другой строке:

//   is
// Метод is определяет, соответствует ли данная строка заданному шаблону. Звездочки можно использовать в качестве подстановочных знаков.

// rtrim
// Метод rtrim обрезает правую часть заданной строки:

}
