<?php

namespace App\Libraries;

class ChuvashAffixLevels
{

    public const LEVELS = [
        1 => [
            ['affix' => 'м', 'name' => 'форма 1-го лица принадлежности существительных'],
            ['affix' => 'ĕ', 'name' => 'форма 3-го лица принадлежности принадлежности существительных'],
            ['affix' => 'и', 'name' => 'форма 3-го лица принадлежности существительных'],
            ['affix' => 'у', 'name' => 'форма 2-го лица единственного числа принадлежности существительных'],
            ['affix' => 'ӳ', 'name' => 'форма 2-го лица единственного числа принадлежности существительных'],
            ['affix' => 'ĕ', 'name' => 'форма 3-е лица принадлежности существительных'],
        ],
        2 => [
            ['affix' => 'ӑр', 'name' => 'форма множественного числа (1-го и 2-го лица) принадлежности существительных'],
            ['affix' => 'ӗр', 'name' => 'форма множественного числа (1-го и 2-го лица) принадлежности существительных'],
            ['affix' => 'ăм', 'name' => 'форма 1-го лица принадлежности существительных'],
            ['affix' => 'ĕм', 'name' => 'форма 1-го лица принадлежности существительных'],
            ['affix' => 'шĕ', 'name' => 'форма 3-е лица принадлежности существительных'],
        ],
        // 1)ӑр,ӗр,ăм,ĕм,м,ĕ,у,ӳ,шĕ    к существительным
        //     -ăм (-ĕм, -м) форма 1-го лица принадлежности 
        //     -ăр (-ĕр) форма множественного числа (1-го и 2-го лица) принадлежности (к существительным) 
        //     -ĕ (-и) форма 3-го лица принадлежности 
        //     -у (-ӳ, диал. -ă, -ĕ) форма 2-го лица единственного числа принадлежности 
        //     -(ш)ĕ 3-е лицо принадлежности
        3 => [
            ['affix' => 'сам', 'name' => 'форма множественного числа существительных'],
            ['affix' => 'сем', 'name' => 'форма множественного числа существительных'],
            ['affix' => 'сен', 'name' => 'форма множественного числа существительных'],
            // ['affix' => 'се', 'name' => 'форма множественного числа существительных'],
        ],
        // сам, сем ,сен    для существительных
        4 => [
            ['affix' => 'лӑ', 'name' => 'аффикс обладания или наличия'],
            ['affix' => 'лӗ', 'name' => 'аффикс обладания или наличия'],
            ['affix' => 'ла', 'name' => 'аффикс уподобления'],
            ['affix' => 'ле', 'name' => 'аффикс уподобления'],
            ['affix' => 'ӑн', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'ӗн', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'лӑх', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'лӗх', 'name' => 'внепадежная форма обладания или наличности'],
        ],
        // 3)лӑ,лӗ, ла, ле,ӑн,ӗн,лӑх,лӗх,внепадежная форма обладания или наличности к существительным прилагательным и к наречиям и к причастиям
        //       ӑн,ӗн образа или способа действия
        //       лӑ,лӗ - обладания или наличия
        //        ла, ле уподобления
        5 => [
            ['affix' => 'м', 'name' => 'порядковая форма числительного'],
            ['affix' => 'н', 'name' => 'собирательная форма числительного'],
        ], // 5 и 6 ой это по сути один и тот же уровень 
        6 => [
            ['affix' => 'ар', 'name' => 'разделительная форма числительного'],
            ['affix' => 'ер', 'name' => 'разделительная форма числительного'],
            ['affix' => 'ăм', 'name' => 'порядковая форма числительного'],
            ['affix' => 'ĕм', 'name' => 'порядковая форма числительного'],
            ['affix' => 'ăн', 'name' => 'собирательная форма числительного'],
            ['affix' => 'ĕн', 'name' => 'собирательная форма числительного'],
            ['affix' => 'мĕш', 'name' => 'порядковая форма числительного'],
            ['affix' => 'шар', 'name' => 'разделительная форма числительного'],
            ['affix' => 'шер', 'name' => 'разделительная форма числительного'],
            // 5 и 6 ой это по сути один и тот же уровень 
        ],
        // 4)ар,ер,ăм,ĕм,м,ăн,ĕн,н,мĕш,шар,шер         присоединяются к числительным  // 21 слово числительных всего
        // -ар (-ер) разделительная форма (числит.)
        // -ăм (-ĕм, -м) порядковая форма, устарелое (числит.)
        // -ăн (-ĕн, -н) собирательная форма (числит.)
        // -мĕш порядковая форма (числит.) 
        // -шар (-шер) разделительная форма (числит.)               
        7 => [
            ['affix' => 'а', 'name' => 'дательный падеж'],
            ['affix' => 'е', 'name' => 'дательный падеж'],
            ['affix' => 'н', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'п', 'name' => 'творительный падеж'],
            ['affix' => 'р', 'name' => 'местный падеж '],
            ['affix' => 'т', 'name' => 'местный падеж'],
            ['affix' => 'ч', 'name' => 'местный падеж '],
        ], // 7 и 8 ой это по сути один и тот же уровень 
        8 => [
            ['affix' => 'нӑн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'нĕн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'на', 'name' => 'дательный падеж'],
            ['affix' => 'не', 'name' => 'дательный падеж'],
            ['affix' => 'ăн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'ĕн', 'name'    => 'притяжательный (родительный) падеж'],
            ['affix' => 'ăнн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'ĕнн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'нн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'па', 'name' => 'творительный падеж'],
            ['affix' => 'пе', 'name' => 'творительный падеж'],
            ['affix' => 'пала', 'name' => 'творительный падеж'],
            ['affix' => 'пеле', 'name' => 'творительный падеж'],
            ['affix' => 'пал', 'name' => 'творительный падеж'],
            ['affix' => 'пел', 'name' => 'творительный падеж'],
            ['affix' => 'палан', 'name' => 'творительный падеж'],
            ['affix' => 'пелен', 'name' => 'творительный падеж'],
            ['affix' => 'паланн', 'name' => 'творительный падеж'],
            ['affix' => 'пеленн', 'name' => 'творительный падеж'],
            ['affix' => 'ра', 'name' => 'местный падеж '],
            ['affix' => 'ре', 'name' => 'местный падеж '],
            ['affix' => 'та', 'name' => 'местный падеж '],
            ['affix' => 'те', 'name' => 'местный падеж '],
            ['affix' => 'че', 'name' => 'местный падеж '],
            ['affix' => 'ран', 'name' => 'исходный падеж '],
            ['affix' => 'рен', 'name' => 'исходный падеж '],
            ['affix' => 'тан', 'name' => 'исходный падеж '],
            ['affix' => 'тен', 'name' => 'исходный падеж '],
            ['affix' => 'чен', 'name' => 'исходный падеж '],
            ['affix' => 'ранн', 'name' => 'исходный падеж '],
            ['affix' => 'ренн', 'name' => 'исходный падеж '],
            ['affix' => 'танн', 'name' => 'исходный падеж '],
            ['affix' => 'тенн', 'name' => 'исходный падеж '],
            ['affix' => 'ченн', 'name' => 'исходный падеж '],
            ['affix' => 'сăр', 'name' => 'лишительный падеж'],
            ['affix' => 'сĕр', 'name' => 'лишительный падеж'],
            ['affix' => 'сăрр', 'name' => 'лишительный падеж '],
            ['affix' => 'сĕрр', 'name' => 'лишительный падеж '],
            ['affix' => 'шăн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'шĕн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'шăнн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'шĕнн', 'name' => 'причинный (причинно-целевой) падеж'],
            // 7 и 8 ой это по сути один и тот же уровень,
        ],
        // 5)а, е,ăн,ĕн,н,ин,ăнн,ĕнн,нн,нăн,нĕн,па,пе,п,пала,пеле,пал,пел,палан,пелен,паланн,пеленн,ра,ре,та,те,че,р,т,ч,ран,рен,тан,тен,чен,ранн,ренн,танн,тенн,ченн,сăр,сĕр,сăрр,сĕрр,шăн,шĕн,шăнн,шĕнн  ко всем частям речи
        //     -а (-е) дательный падеж
        //     -ăн (-ĕн, -н, -ăнн, -ĕнн, -нн) притяжательный (родительный) падеж 
        //     -нăн (-нĕн) притяжательный падеж, устарелое (то же, что -ăн (-ĕн)) 
        //     -па (-пе, -п, -пала, -пеле, -пал, -пел, -палан, -пелен, -паланн-, пеленн-) творительный падеж 
        //     -ра (-ре, -та, -те, -че, -р, -т, -ч) местный падеж 
        //     -ран (-рен, -тан, -тен, -чен, -ранн, -ренн, -танн, -тенн, -ченн) исходный падеж 
        //     -сăр (-сĕр, -сăрр, -сĕрр) лишительный падеж 
        //     -шăн (-шĕн, -шăнн, -шĕнн) причинный (причинно-целевой) падеж
        9 => [
            ['affix' => 'ç', 'name' => 'взаимно совместный залог глагола'],
            ['affix' => 'ш', 'name' => 'взаимно совместный залог глагола'],
            // 9 и 10 ой это по сути один и тот же уровень,  
        ],
        10 => [
            ['affix' => 'рах', 'name' => 'сравнительная форма (компаратив) глагола'],
            ['affix' => 'рех', 'name' => 'сравнительная форма (компаратив) глагола'],
            ['affix' => 'тарах', 'name' => 'сравнительная форма (компаратив) глагола'],
            ['affix' => 'терех', 'name' => 'сравнительная форма (компаратив) глагола'],
            ['affix' => 'тарахх', 'name' => 'сравнительная форма (компаратив) глагола'],
            ['affix' => 'терехх', 'name' => 'сравнительная форма (компаратив) глагола'],
            ['affix' => 'тар', 'name' => 'понудительный залог глагола'],
            ['affix' => 'тер', 'name' => 'понудительный залог глагола'],
            ['affix' => 'ттар', 'name' => 'понудительный залог глагола'],
            ['affix' => 'ттер', 'name' => 'понудительный залог глагола'],
            ['affix' => 'ар', 'name' => 'понудительный залог глагола'],
            ['affix' => 'ер', 'name' => 'понудительный залог глагола'],
            ['affix' => 'ăн', 'name' => 'возвратно страдательный залог глагола'],
            ['affix' => 'ĕн', 'name' => 'возвратно страдательный залог глагола'],
            ['affix' => 'ăл', 'name' => 'возвратно страдательный залог глагола'],
            ['affix' => 'ĕл', 'name' => 'возвратно страдательный залог глагола'],
            ['affix' => 'ăç', 'name' => 'взаимно совместный залог глагола'],
            ['affix' => 'ĕç', 'name' => 'взаимно совместный залог глагола'],
            ['affix' => 'ăш', 'name' => 'взаимно совместный залог глагола'],
            ['affix' => 'ĕш', 'name' => 'взаимно совместный залог глагола'],
            ['affix' => 'аш', 'name' => 'взаимно совместный залог глагола'],
            ['affix' => 'еш', 'name' => 'взаимно совместный залог глагола'],
            // 9 и 10 ой это по сути один и тот же уровень,
        ],
        // для глаголов
        //    -рах (-рех, -тарах, -терех, -рахх, -рехх, -тарахх, -терехх) сравнительная форма (компаратив)  для прилагательных , существительных(несколько), наречий и  глагол(значение приблизительности в некоторых контекстах)
        //    -тар (-тер), -ттар (-ттер) понудительный залог / понудительная (каузативная) форма глагола
        //    -ар (-ер) понудительный залог / понудительная  форма глагола 
        //    -ăн (-ĕн) -ăл (-ĕл)  возвратно страдательный залог к глаголам
        //    -ăç (-ĕç, -ç) [залог взаимный] взаимно совместный залог
        //    -ăш (-ĕш) аш еш [залог взаимный] взаимно совместный залог
        //    -ç -ш    взаимно совместный залог
        11 => [
            ['affix' => 'й', 'name' => 'желательное наклонение глаголов'],
            // 11 и 12 это по сути один и тот же уровень,
        ],

        12 => [
            ['affix' => 'ай', 'name' => 'желательное наклонение глаголов'],
            ['affix' => 'ей', 'name' => 'желательное наклонение глаголов'],
            ['affix' => 'ăтт', 'name' => '[сослагательное наклонение] будущее условное время глагола'],
            ['affix' => 'ĕтт', 'name' => '[сослагательное наклонение] будущее условное время глагола'],
            ['affix' => 'тт', 'name' => '[сослагательное наклонение] будущее условное время глагола'],
            // 11 и 12 это по сути один и тот же уровень,
        ],
        // для глаголов
        // 7)ай, ей, й, ăтт, ĕтт, тт    для глаголов
        // -ай (-ей, -й, диал. -и) желательное наклонение
        // -ăтт (-ĕтт, -тт) [сослагательное наклонение] будущее условное время глагола: -ă (-ĕ) (будущее время) + -ттă (-ттĕ, -чч) 
        13 => [
            ['affix' => 'м', 'name' => 'отрицательная форма глаголов'],
            //13 и 14 ой это по сути один и тот же уровень 
        ],
        14 => [
            ['affix' => 'ма', 'name' => 'отрицательная форма глаголов'],
            ['affix' => 'ме', 'name' => 'отрицательная форма глаголов'],
            ['affix' => 'мас', 'name' => 'отрицательная форма глаголов'],
            ['affix' => 'мес', 'name' => 'отрицательная форма глаголов'],
            //13 и 14 ой это по сути один и тот же уровень 
        ],
        // для глаголов
        //  8)ма,ме,м,мас,мес    для глаголов
        // -ма (-ме, -м) отрицательная форма (глаголов)
        // -мас (-мес) отрицательная форма 
        15 => [
            ['affix' => 'ă', 'name' => 'будущее время'],
            ['affix' => 'ĕ', 'name' => 'будущее время'],
            ['affix' => 'р', 'name' => 'прошедшее время глагола'],
            ['affix' => 'т', 'name' => 'прошедшее время глагола'],
            ['affix' => 'ч', 'name' => 'прошедшее время глагола '],
            //15 и 16 ой это по сути один и тот же уровень 
        ],
        16 => [
            ['affix' => 'ат', 'name' => 'настоящее время глагола'],
            ['affix' => 'ать', 'name' => 'настоящее время глагола'],
            ['affix' => 'ет', 'name' => 'настоящее время глагола'],
            ['affix' => 'ăтт', 'name' => 'сослагательное наклонение глагола'],
            ['affix' => 'ĕтт', 'name' => 'сослагательное наклонение глагола'],
            ['affix' => 'тт', 'name' => 'сослагательное наклонение глагола'],
            ['affix' => 'ттă', 'name' => ' будущем условное времени глагола'],
            ['affix' => 'ттĕ', 'name' => ' будущем условное времени глагола'],
            ['affix' => 'чч', 'name' => '???????????'],
            ['affix' => 'кала', 'name' => 'многократность (многократное время) (учащительная форма) глагола'],
            ['affix' => 'келе', 'name' => 'многократность (многократное время) (учащительная форма) глагола'],
            ['affix' => 'рă', 'name' => 'прошедшее время глагола'],
            ['affix' => 'рĕ', 'name' => 'прошедшее время глагола'],
            ['affix' => 'тă', 'name' => 'прошедшее однократное время глагола'],
            ['affix' => 'тĕ', 'name' => 'прошедшее однократное время глагола'],
            ['affix' => 'сатт', 'name' => 'прошедшее время глагола'],
            ['affix' => 'сетт', 'name' => 'прошедшее время глагола'],
            //15 и 16 ой это по сути один и тот же уровень 
        ],
        // для глаголов

        // 9)ат,ет,ă,ĕ,ăтт,ĕтт,тт, ттă,ттĕ,чч,кала,келе,р,т,рă,рĕ,тă,тĕ,ч,сатт,сетт,т,тă,ч,тт,ттă,ттĕ,    для глаголов
        // -ат (-ет) настоящее время
        // -ă (-ĕ) будущее время
        // -ăтт (-ĕтт, -тт) [сослагательное наклонение]  
        // -кала (-келе) многократность (многократное время) (учащительная форма) 
        // -р (-т, -рă, -рĕ, -тă, -тĕ, -ч) прошедшее время глагола 
        // -сатт (-сетт) прошедшее время глагола
        // -т (-тă, -ч, -тт, ) прошедшее время глагола 
        // -тă (-тĕ, -рă, -рĕ, -р, -ч) прошедшее однократное время глагола
        // -ттă (-ттĕ, ) будущем условное времени глагола
        17 => [
            ['affix' => 'и', 'name' => 'причастие возможности для глаголов'],
            ['affix' => 'с', 'name' => 'причастие будущее время для глаголов'],
            ['affix' => 'н', 'name' => 'причастие настоящее время для глаголов'], //???????????? здесь н выступает еще как причастие прошедшего времени (прошедшее неопределенное время глагола)
            //17 и 18 ой это по сути один и тот же уровень
        ],
        18 => [
            ['affix' => 'акан', 'name' => 'причастие настоящее время '],
            ['affix' => 'екен', 'name' => 'причастие настоящее время '],
            ['affix' => 'аканн', 'name' => 'причастие настоящее время '],
            ['affix' => 'екенн', 'name' => 'причастие настоящее время '],
            ['affix' => 'кан', 'name' => 'причастие настоящее время '],
            ['affix' => 'кен', 'name' => 'причастие настоящее время '],
            ['affix' => 'канн', 'name' => 'причастие настоящее время '],
            ['affix' => 'кенн', 'name' => 'причастие настоящее время '],
            ['affix' => 'ан', 'name' => 'причастие настоящее время'],
            ['affix' => 'ен', 'name' => 'причастие настоящее время'],
            ['affix' => 'анçи', 'name' => 'причастие'],
            ['affix' => 'енçи', 'name' => 'причастие'],
            ['affix' => 'ас', 'name' => 'причастие будущее время'],
            ['affix' => 'ес', 'name' => 'причастие будущее время'],
            ['affix' => 'асс', 'name' => 'причастие будущее время'],
            ['affix' => 'есс', 'name' => 'причастие будущее время'],
            ['affix' => 'сс', 'name' => 'причастие будущее время'],
            ['affix' => 'малăх', 'name' => 'причастие'],
            ['affix' => 'мелĕх', 'name' => 'причастие'],
            ['affix' => 'малла', 'name' => 'причастие долженствовательное или повелительное'],
            ['affix' => 'мелле', 'name' => 'причастие долженствовательное или повелительное'],
            ['affix' => 'малл', 'name' => 'причастие долженствовательное или повелительное'],
            ['affix' => 'мелл', 'name' => 'причастие долженствовательное или повелительное'],
            ['affix' => 'нă', 'name' => 'причастие прошедшего времени (прошедшее неопределенное время глагола) '],
            ['affix' => 'нĕ', 'name' => 'причастие прошедшего времени (прошедшее неопределенное время глагола) '],
        ],     //17 и 18 ой это по сути один и тот же уровень
        // для глаголов
        // 10) и,акан,екен,кан,кен,аканн,екенн,канн,кенн,ан,ен,анçи,енçи,ас,ес,с,асс,есс,сс,малăх,мелĕх,малла,мелле,малл,мелл,нă,нĕ,н к глаголам                          
        // -и причастие возможности  
        // -акан (-екен, -кан, -кен, -аканн, -екенн, -канн, -кенн) причастие настоящее время 
        // -ан (-ен, -н) причастие настоящее время
        // -анçи (-енçи) причастие
        // -ас (-ес, -с, -асс, -есс, -сс) причастие будущее время
        // -малăх (-мелĕх) причастие 
        // -малла (-мелле, -малл, -мелл) причастие долж. или повел. 
        // -нă (-нĕ, -н) причастие прошедшего времени (прошедшее неопределенное время глагола) 
        19 => [
            ['affix' => 'а', 'name' => 'деепричастие'],
            ['affix' => 'е', 'name' => 'деепричастие'],
        ],
        20 => [
            ['affix' => 'иччен', 'name' => 'деепричастие'],
            ['affix' => 'массерен', 'name' => 'деепричастие'],
            ['affix' => 'мессерен', 'name' => 'деепричастие'],
            ['affix' => 'нăранпа', 'name' => 'деепричастие'],
            ['affix' => 'нĕренпе', 'name' => 'деепричастие'],
            ['affix' => 'нăçем', 'name' => 'деепричастие'],
            ['affix' => 'нĕçем', 'name' => 'деепричастие'],
            ['affix' => 'нăçемĕн', 'name' => 'деепричастие'],
            ['affix' => 'ĕçемĕн', 'name' => 'деепричастие'],
            ['affix' => 'са', 'name' => 'деепричастие'],
            ['affix' => 'се', 'name' => 'деепричастие'],
            ['affix' => 'сан', 'name' => 'деепричастие'],
            ['affix' => 'сен', 'name' => 'деепричастие'],
            ['affix' => 'сассăн', 'name' => 'деепричастие'],
            ['affix' => 'сессĕн', 'name' => 'деепричастие'],
            ['affix' => 'çем', 'name' => 'деепричастие'],
            ['affix' => 'ĕн', 'name' => 'деепричастие'],
            ['affix' => 'уçăн', 'name' => 'деепричастие'],
            ['affix' => 'ӳçĕн', 'name' => 'деепричастие'],
        ],
        // для глаголов
        // 10) а,е,
        // 10) иччен,массерен,мессерен,нăранпа,нĕренпе,нăçем,нĕçем,нăçемĕн,ĕçемĕн,са,се,сан,сен,сассăн,сессĕн,çем,ĕн,уçăн,ӳçĕн 
        // -иччен деепричастие 
        // -а (-е) деепричастие 
        // -массерен(-мессерен) деепричастие
        // -нăранпа (-нĕренпе) деепричастие
        // -нăçем (-нĕçем), -нăçемĕн (-ĕçемĕн) деепричастие
        // -са (-се) деепричастие 
        // -сан (-сен) деепричастие 
        // -сассăн (-сессĕн) деепричастие
        // -çем (-çем-ĕн) деепричастие  ????????????????????
        // -уçăн (-ӳçĕн) деепричастие
        21 => [['affix' => 'м', 'name' => 'инфинитив'],],
        // для глаголов
        22 => [
            ['affix' => 'ма', 'name' => 'инфинитив'],
            ['affix' => 'ма', 'name' => 'инфинитив'],
            ['affix' => 'машкӑн', 'name' => 'инфинитив'],
            ['affix' => 'мешкӗн', 'name' => 'инфинитив'],
        ],
        // для глаголов
        // 10) ма, ме, м , машкӑн, мешкӗн    
        //   -ма (-ме, -м, ) инфинитив 
        //    машкӑн, мешкӗн          инфинитив
        23 => [
            ['affix' => 'х', 'name' => 'прошедшее время '],
        ],     //23 и 24 ой это по сути один и тот же уровень  
        // для всех
        24 => [
            ['affix' => 'ах', 'name' => 'прошедшее время '],
            ['affix' => 'ех', 'name' => 'прошедшее время '],
        ],     //23 и 24 ой это по сути один и тот же уровень  
        // для всех
        25 => [
            ['affix' => 'чен', 'name' => 'прошедшее время '],
            ['affix' => 'ччен', 'name' => 'прошедшее время '],
        ],     //23 и 24 ой это по сути один и тот же уровень                
        // // для всех
        26 => [
            ['affix' => 'ччӗ', 'name' => 'прошедшее время '],
            ['affix' => 'чӗ', 'name' => 'прошедшее время '],
        ],
        // для всех
        // 11) ах, ех, х, Any
        // 12) чен ччен Any  ///
        // 13) ччӗ, чӗ  Any  -чĕ (-ччĕ) прошедшее время 
    ];





    //  последовательность следования аффиксов для глаголов
    public const LEVELS_verb = [

        9 => [
            ['affix' => 'ç', 'name' => 'взаимно совместный залог глагола'],
            ['affix' => 'ш', 'name' => 'взаимно совместный залог глагола'],
            // 9 и 10 ой это по сути один и тот же уровень,  
        ],
        10 => [
            ['affix' => 'рах', 'name' => 'сравнительная форма (компаратив) глагола'],
            ['affix' => 'рех', 'name' => 'сравнительная форма (компаратив) глагола'],
            ['affix' => 'тарах', 'name' => 'сравнительная форма (компаратив) глагола'],
            ['affix' => 'терех', 'name' => 'сравнительная форма (компаратив) глагола'],
            ['affix' => 'тарахх', 'name' => 'сравнительная форма (компаратив) глагола'],
            ['affix' => 'терехх', 'name' => 'сравнительная форма (компаратив) глагола'],
            ['affix' => 'тар', 'name' => 'понудительный залог глагола'],
            ['affix' => 'тер', 'name' => 'понудительный залог глагола'],
            ['affix' => 'ттар', 'name' => 'понудительный залог глагола'],
            ['affix' => 'ттер', 'name' => 'понудительный залог глагола'],
            ['affix' => 'ар', 'name' => 'понудительный залог глагола'],
            ['affix' => 'ер', 'name' => 'понудительный залог глагола'],
            ['affix' => 'ăн', 'name' => 'возвратно страдательный залог глагола'],
            ['affix' => 'ĕн', 'name' => 'возвратно страдательный залог глагола'],
            ['affix' => 'ăл', 'name' => 'возвратно страдательный залог глагола'],
            ['affix' => 'ĕл', 'name' => 'возвратно страдательный залог глагола'],
            ['affix' => 'ăç', 'name' => 'взаимно совместный залог глагола'],
            ['affix' => 'ĕç', 'name' => 'взаимно совместный залог глагола'],
            ['affix' => 'ăш', 'name' => 'взаимно совместный залог глагола'],
            ['affix' => 'ĕш', 'name' => 'взаимно совместный залог глагола'],
            ['affix' => 'аш', 'name' => 'взаимно совместный залог глагола'],
            ['affix' => 'еш', 'name' => 'взаимно совместный залог глагола'],
            // 9 и 10 ой это по сути один и тот же уровень,
        ],
        11 => [
            ['affix' => 'й', 'name' => 'желательное наклонение глаголов'],
            // 11 и 12 это по сути один и тот же уровень,
        ],
        12 => [
            ['affix' => 'ай', 'name' => 'желательное наклонение глаголов'],
            ['affix' => 'ей', 'name' => 'желательное наклонение глаголов'],
            ['affix' => 'тт', 'name' => '[сослагательное наклонение] будущее условное время глагола'],
            ['affix' => 'ăтт', 'name' => '[сослагательное наклонение] будущее условное время глагола'],
            ['affix' => 'ĕтт', 'name' => '[сослагательное наклонение] будущее условное время глагола'],

            // 11 и 12 это по сути один и тот же уровень,
        ],
        // для глаголов
        13 => [
            ['affix' => 'м', 'name' => 'отрицательная форма глаголов'],
            //13 и 14 ой это по сути один и тот же уровень 
        ],
        14 => [
            ['affix' => 'ма', 'name' => 'отрицательная форма глаголов'],
            ['affix' => 'ме', 'name' => 'отрицательная форма глаголов'],
            ['affix' => 'мас', 'name' => 'отрицательная форма глаголов'],
            ['affix' => 'мес', 'name' => 'отрицательная форма глаголов'],
            //13 и 14 ой это по сути один и тот же уровень 
        ],
        // для глаголов
        15 => [
            ['affix' => 'ă', 'name' => 'будущее время'],
            ['affix' => 'ĕ', 'name' => 'будущее время'],
            ['affix' => 'р', 'name' => 'прошедшее время глагола'],
            ['affix' => 'т', 'name' => 'прошедшее время глагола'],
            ['affix' => 'ч', 'name' => 'прошедшее время глагола '],
            
            
            ['affix' => 'и', 'name' => 'причастие возможности для глаголов'],
            ['affix' => 'с', 'name' => 'причастие будущее время для глаголов'],
            ['affix' => 'н', 'name' => 'причастие настоящее время для глаголов'], //???????????? здесь н выступает еще как причастие прошедшего времени (прошедшее неопределенное время глагола)

            ['affix' => 'а', 'name' => 'деепричастие'],
            ['affix' => 'е', 'name' => 'деепричастие'],

            ['affix' => 'м', 'name' => 'инфинитив'],

            //15 и 16 ой это по сути один и тот же уровень 
        ],
        16 => [
            ['affix' => 'ат', 'name' => 'настоящее время глагола'],
            ['affix' => 'ет', 'name' => 'настоящее время глагола'],
            ['affix' => 'тт', 'name' => 'сослагательное наклонение глагола'],
            ['affix' => 'чч', 'name' => '???????????'],
            ['affix' => 'рă', 'name' => 'прошедшее время глагола'],
            ['affix' => 'рĕ', 'name' => 'прошедшее время глагола'],
            ['affix' => 'тă', 'name' => 'прошедшее однократное время глагола'],
            ['affix' => 'тĕ', 'name' => 'прошедшее однократное время глагола'],
            ['affix' => 'ать', 'name' => 'настоящее время глагола'],
            ['affix' => 'ттă', 'name' => ' будущем условное времени глагола'],
            ['affix' => 'ттĕ', 'name' => ' будущем условное времени глагола'],
            ['affix' => 'ăтт', 'name' => 'сослагательное наклонение глагола'],
            ['affix' => 'ĕтт', 'name' => 'сослагательное наклонение глагола'],
            ['affix' => 'сатт', 'name' => 'прошедшее время глагола'],
            ['affix' => 'сетт', 'name' => 'прошедшее время глагола'],
            ['affix' => 'кала', 'name' => 'многократность (многократное время) (учащительная форма) глагола'],
            ['affix' => 'келе', 'name' => 'многократность (многократное время) (учащительная форма) глагола'],

            ['affix' => 'ан', 'name' => 'причастие настоящее время'],
            ['affix' => 'ен', 'name' => 'причастие настоящее время'],
            ['affix' => 'ас', 'name' => 'причастие будущее время'],
            ['affix' => 'ес', 'name' => 'причастие будущее время'],
            ['affix' => 'сс', 'name' => 'причастие будущее время'],
            ['affix' => 'нă', 'name' => 'причастие прошедшего времени (прошедшее неопределенное время глагола) '],
            ['affix' => 'нĕ', 'name' => 'причастие прошедшего времени (прошедшее неопределенное время глагола) '],
            ['affix' => 'кан', 'name' => 'причастие настоящее время '],
            ['affix' => 'кен', 'name' => 'причастие настоящее время '],
            ['affix' => 'асс', 'name' => 'причастие будущее время'],
            ['affix' => 'есс', 'name' => 'причастие будущее время'],
            ['affix' => 'анçи', 'name' => 'причастие'],
            ['affix' => 'енçи', 'name' => 'причастие'],
            ['affix' => 'малл', 'name' => 'причастие долженствовательное или повелительное'],
            ['affix' => 'мелл', 'name' => 'причастие долженствовательное или повелительное'],
            ['affix' => 'канн', 'name' => 'причастие настоящее время '],
            ['affix' => 'кенн', 'name' => 'причастие настоящее время '],
            ['affix' => 'акан', 'name' => 'причастие настоящее время '],
            ['affix' => 'екен', 'name' => 'причастие настоящее время '],
            ['affix' => 'малăх', 'name' => 'причастие'],
            ['affix' => 'мелĕх', 'name' => 'причастие'],
            ['affix' => 'малла', 'name' => 'причастие долженствовательное или повелительное'],
            ['affix' => 'мелле', 'name' => 'причастие долженствовательное или повелительное'],
            ['affix' => 'аканн', 'name' => 'причастие настоящее время '],
            ['affix' => 'екенн', 'name' => 'причастие настоящее время '],

            ['affix' => 'са', 'name' => 'деепричастие'],
            ['affix' => 'се', 'name' => 'деепричастие'],
            ['affix' => 'ĕн', 'name' => 'деепричастие'],
            ['affix' => 'сан', 'name' => 'деепричастие'],
            ['affix' => 'сен', 'name' => 'деепричастие'],
            ['affix' => 'çем', 'name' => 'деепричастие'],
            ['affix' => 'уçăн', 'name' => 'деепричастие'],
            ['affix' => 'ӳçĕн', 'name' => 'деепричастие'],
            ['affix' => 'нăçем', 'name' => 'деепричастие'],
            ['affix' => 'нĕçем', 'name' => 'деепричастие'],
            ['affix' => 'иччен', 'name' => 'деепричастие'],
            ['affix' => 'сассăн', 'name' => 'деепричастие'],
            ['affix' => 'сессĕн', 'name' => 'деепричастие'],
            ['affix' => 'ĕçемĕн', 'name' => 'деепричастие'],
            ['affix' => 'нăранпа', 'name' => 'деепричастие'],
            ['affix' => 'нĕренпе', 'name' => 'деепричастие'],
            ['affix' => 'нăçемĕн', 'name' => 'деепричастие'],
            ['affix' => 'массерен', 'name' => 'деепричастие'],
            ['affix' => 'мессерен', 'name' => 'деепричастие'],

            ['affix' => 'ма', 'name' => 'инфинитив'],
            ['affix' => 'ма', 'name' => 'инфинитив'],
            ['affix' => 'машкӑн', 'name' => 'инфинитив'],
            ['affix' => 'мешкӗн', 'name' => 'инфинитив'],

        ],
        // для глаголов

        17 => [
               ['affix' => 'п', 'name' => 'аффиксы первого лица глаголов'],
                ['affix' => 'м', 'name' => 'аффиксы первого лица глаголов'],
            //17 и 18 ой это по сути один и тот же уровень
        ],
        18 => [
               ['affix' => 'ӑп', 'name' => 'аффиксы первого лица глаголов'],
              ['affix' => 'ӗп', 'name' => 'аффиксы первого лица глаголов'],
               ['affix' => 'ӑм', 'name' => 'аффиксы первого лица глаголов'],
               ['affix' => 'ӗм', 'name' => 'аффиксы первого лица глаголов'],
        ],
        //17 и 18 ой это по сути один и тот же уровень
        // для глаголов
        19 => [ 
               ['affix' => 'ӑр', 'name' => 'аффикс множественного числа глаголов'],
               ['affix' => 'ӗр', 'name' => 'аффикс множественного числа глаголов'],
               ['affix' => 'аҫ', 'name' => 'аффикс множественного числа глаголов'],
               ['affix' => 'еҫ', 'name' => 'аффикс множественного числа глаголов'],
               ['affix' => 'ҫ', 'name' => 'аффикс множественного числа глаголов'],
               ],

        20 => [        ],
        // для глаголов     
        21 => [        ],  // деепричастные, причастные и инфинитивные аффиксы на том же уровне что и наклонение и время 
        // для глаголов                                     // и после них поставить аффиксы лица ['ӑп', 'ӗп', 'п',  'ӑм', 'ӗм', 'м']  
        22 => [        ],
        // для глаголов
        23 => [
            ['affix' => 'чен', 'name' => 'прошедшее время '],
            ['affix' => 'ччен', 'name' => 'прошедшее время '],
        ],
        // для всех
        24 => [
            ['affix' => 'х', 'name' => 'прошедшее время '],
        ],     //24 и 25 ой это по сути один и тот же уровень  
        // для всех
        25 => [
            ['affix' => 'ах', 'name' => 'прошедшее время '],
            ['affix' => 'ех', 'name' => 'прошедшее время '],
        ],     //24 и 25 ой это по сути один и тот же уровень  
        // для всех
        26 => [
            ['affix' => 'чӗ', 'name' => 'прошедшее время '],
            ['affix' => 'ччӗ', 'name' => 'прошедшее время '],
        ],
        // для всех
    ];

    //  последовательность следования аффиксов для существительных
    public const LEVELS_noun = [ 
        1 => [
            ['affix' => 'м', 'name' => 'форма 1-го лица принадлежности существительных'],
            ['affix' => 'ĕ', 'name' => 'форма 3-го лица принадлежности существительных'],
            ['affix' => 'и', 'name' => 'форма 3-го лица принадлежности существительных'],
            ['affix' => 'у', 'name' => 'форма 2-го лица единственного числа принадлежности существительных'],
            ['affix' => 'ӳ', 'name' => 'форма 2-го лица единственного числа принадлежности существительных'],
            ['affix' => 'ĕ', 'name' => 'форма 3-е лица принадлежности существительных'],
        ],
        2 => [
            ['affix' => 'ӑр', 'name' => 'форма множественного числа (1-го и 2-го лица) принадлежности существительных'],
            ['affix' => 'ӗр', 'name' => 'форма множественного числа (1-го и 2-го лица) принадлежности существительных'],
            ['affix' => 'ăм', 'name' => 'форма 1-го лица принадлежности существительных'],
            ['affix' => 'ĕм', 'name' => 'форма 1-го лица принадлежности существительных'],
            ['affix' => 'шĕ', 'name' => 'форма 3-е лица принадлежности существительных'],
        ],
        3 => [
            ['affix' => 'сам', 'name' => 'форма множественного числа существительных'],
            ['affix' => 'сем', 'name' => 'форма множественного числа существительных'],
            ['affix' => 'сен', 'name' => 'форма множественного числа существительных'],
            // ['affix' => 'се', 'name' => 'форма множественного числа существительных'],
        ],
        4 => [
            ['affix' => 'лӑ', 'name' => 'форма обладания или наличия'],
            ['affix' => 'лӗ', 'name' => 'форма обладания или наличия'],
            ['affix' => 'ла', 'name' => 'форма уподобления'],
            ['affix' => 'ле', 'name' => 'форма уподобления'],
            ['affix' => 'ӑн', 'name' => 'форма образа действия'],  // омонимичный аффикс , аналог  - 'ăн''ӗн', 'name' => 'притяжательный (родительный) падеж'
            ['affix' => 'ӗн', 'name' => 'форма образа действия'],  // уйӑхӑн , пиччӗн - лиццевой стороной. омонимичный аффикс , аналог  - 'ӗн', 'name' => 'притяжательный (родительный) падеж'
            ['affix' => 'лӑх', 'name' => 'форма назначения или цели'],
            ['affix' => 'лӗх', 'name' => 'форма назначения или цели'],
        ],
        7 => [
            ['affix' => 'а', 'name' => 'дательный падеж'],
            ['affix' => 'е', 'name' => 'дательный падеж'],
            ['affix' => 'н', 'name' => 'притяжательный (родительный) падеж'],
            // ['affix' => 'п', 'name' => 'творительный падеж'],  // п моежт быть только в том случае если за ним идет еще один аффикс
            ['affix' => 'р', 'name' => 'местный падеж '],
            ['affix' => 'т', 'name' => 'местный падеж'],
            ['affix' => 'ч', 'name' => 'местный падеж '],
        ], // 7 и 8 ой это по сути один и тот же уровень  //  Ubuntu 22.04.5 LTS

        8 => [
            ['affix' => 'та', 'name' => 'местный падеж'],
            ['affix' => 'те', 'name' => 'местный падеж'],
            ['affix' => 'ра', 'name' => 'местный падеж'],
            ['affix' => 'ре', 'name' => 'местный падеж'],
            ['affix' => 'че', 'name' => 'местный падеж'],
            ['affix' => 'па', 'name' => 'творительный падеж'],
            ['affix' => 'пе', 'name' => 'творительный падеж'],
            ['affix' => 'на', 'name' => 'дательный падеж'],
            ['affix' => 'не', 'name' => 'дательный падеж'],
            ['affix' => 'нн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'ăн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'ĕн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'пал', 'name' => 'творительный падеж'],
            ['affix' => 'пел', 'name' => 'творительный падеж'],
            ['affix' => 'тан', 'name' => 'исходный падеж'],
            ['affix' => 'тен', 'name' => 'исходный падеж'],
            ['affix' => 'ран', 'name' => 'исходный падеж'],
            ['affix' => 'рен', 'name' => 'исходный падеж'],
            ['affix' => 'чен', 'name' => 'исходный падеж'],
            ['affix' => 'шăн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'шĕн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'сăр', 'name' => 'лишительный падеж'],
            ['affix' => 'сĕр', 'name' => 'лишительный падеж'],
            ['affix' => 'нӑн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'нĕн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'ăнн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'ĕнн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'пала', 'name' => 'творительный падеж'],
            ['affix' => 'пеле', 'name' => 'творительный падеж'],
            ['affix' => 'танн', 'name' => 'исходный падеж'],
            ['affix' => 'тенн', 'name' => 'исходный падеж'],
            ['affix' => 'ранн', 'name' => 'исходный падеж'],
            ['affix' => 'ренн', 'name' => 'исходный падеж'],
            ['affix' => 'ченн', 'name' => 'исходный падеж'],
            ['affix' => 'шăнн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'шĕнн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'сăрр', 'name' => 'лишительный падеж'],
            ['affix' => 'сĕрр', 'name' => 'лишительный падеж'],
            ['affix' => 'палан', 'name' => 'творительный падеж'],
            ['affix' => 'пелен', 'name' => 'творительный падеж'],
            ['affix' => 'паланн', 'name' => 'творительный падеж'],
            ['affix' => 'пеленн', 'name' => 'творительный падеж'],
        ],
        // 7 и 8 ой это по сути один и тот же уровень,

        23 => [
            ['affix' => 'чен', 'name' => 'прошедшее время '],
            ['affix' => 'ччен', 'name' => 'прошедшее время '],
        ],
        // для всех
        24 => [
            ['affix' => 'х', 'name' => 'прошедшее время '],
        ],     //24 и 25 ой это по сути один и тот же уровень  
        // для всех
        25 => [
            ['affix' => 'ах', 'name' => 'прошедшее время '],
            ['affix' => 'ех', 'name' => 'прошедшее время '],
        ],     //24 и 25 ой это по сути один и тот же уровень  
        // для всех
        26 => [
            ['affix' => 'чӗ', 'name' => 'прошедшее время '],
            ['affix' => 'ччӗ', 'name' => 'прошедшее время '],
        ],
        // для всех
    ];

// Вот массив аффиксов для существительных. Как мне это все интегрировать в теорию графов? Как мне эти уровни с 1 го по 7 ой уровень?
// суть этого массива следующая - я сначала ищу в слове овнову и если нашел основу то в оставшейся строке ищу аффиксы начиная 
// с уровня 7 и поднимаясь до уровня 1. Например если не найдены аффиксы на уровне 7 то перехожу поисков аффикса на уровене 6 и так далее. 

//     public const LEVELS_noun = [ 
//         1 => [
//             ['affix' => 'м', 'name' => 'форма 1-го лица принадлежности существительных'],
//             ['affix' => 'ĕ', 'name' => 'форма 3-го лица принадлежности существительных'],
//             ['affix' => 'и', 'name' => 'форма 3-го лица принадлежности существительных'],
//             ['affix' => 'у', 'name' => 'форма 2-го лица единственного числа принадлежности существительных'],
//             ['affix' => 'ӳ', 'name' => 'форма 2-го лица единственного числа принадлежности существительных'],
//             ['affix' => 'ĕ', 'name' => 'форма 3-е лица принадлежности существительных'],
//         ],
//         1 => [
//             ['affix' => 'ӑр', 'name' => 'форма множественного числа (1-го и 2-го лица) принадлежности существительных'],
//             ['affix' => 'ӗр', 'name' => 'форма множественного числа (1-го и 2-го лица) принадлежности существительных'],
//             ['affix' => 'ăм', 'name' => 'форма 1-го лица принадлежности существительных'],
//             ['affix' => 'ĕм', 'name' => 'форма 1-го лица принадлежности существительных'],
//             ['affix' => 'шĕ', 'name' => 'форма 3-е лица принадлежности существительных'],
//         ],
//         2 => [
//             ['affix' => 'сам', 'name' => 'форма множественного числа существительных'],
//             ['affix' => 'сем', 'name' => 'форма множественного числа существительных'],
//             ['affix' => 'сен', 'name' => 'форма множественного числа существительных'],
//             // ['affix' => 'се', 'name' => 'форма множественного числа существительных'],
//         ],
//         3 => [
//             ['affix' => 'лӑ', 'name' => 'форма обладания или наличия'],
//             ['affix' => 'лӗ', 'name' => 'форма обладания или наличия'],
//             ['affix' => 'ла', 'name' => 'форма уподобления'],
//             ['affix' => 'ле', 'name' => 'форма уподобления'],
//             ['affix' => 'ӑн', 'name' => 'форма образа действия'],  // омонимичный аффикс , аналог  - 'ăн''ӗн', 'name' => 'притяжательный (родительный) падеж'
//             ['affix' => 'ӗн', 'name' => 'форма образа действия'],  // уйӑхӑн , пиччӗн - лиццевой стороной. омонимичный аффикс , аналог  - 'ӗн', 'name' => 'притяжательный (родительный) падеж'
//             ['affix' => 'лӑх', 'name' => 'форма назначения или цели'],
//             ['affix' => 'лӗх', 'name' => 'форма назначения или цели'],
//         ],
//         4 => [
//             ['affix' => 'а', 'name' => 'дательный падеж'],
//             ['affix' => 'е', 'name' => 'дательный падеж'],
//             ['affix' => 'н', 'name' => 'притяжательный (родительный) падеж'],
//             // ['affix' => 'п', 'name' => 'творительный падеж'],  // п моежт быть только в том случае если за ним идет еще один аффикс
//             ['affix' => 'р', 'name' => 'местный падеж '],
//             ['affix' => 'т', 'name' => 'местный падеж'],
//             ['affix' => 'ч', 'name' => 'местный падеж '],
//         ], // 7 и 8 ой это по сути один и тот же уровень  //  Ubuntu 22.04.5 LTS

//         4 => [
//             ['affix' => 'та', 'name' => 'местный падеж'],
//             ['affix' => 'те', 'name' => 'местный падеж'],
//             ['affix' => 'ра', 'name' => 'местный падеж'],
//             ['affix' => 'ре', 'name' => 'местный падеж'],
//             ['affix' => 'че', 'name' => 'местный падеж'],
//             ['affix' => 'па', 'name' => 'творительный падеж'],
//             ['affix' => 'пе', 'name' => 'творительный падеж'],
//             ['affix' => 'на', 'name' => 'дательный падеж'],
//             ['affix' => 'не', 'name' => 'дательный падеж'],
//             ['affix' => 'нн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'ăн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'ĕн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'пал', 'name' => 'творительный падеж'],
//             ['affix' => 'пел', 'name' => 'творительный падеж'],
//             ['affix' => 'тан', 'name' => 'исходный падеж'],
//             ['affix' => 'тен', 'name' => 'исходный падеж'],
//             ['affix' => 'ран', 'name' => 'исходный падеж'],
//             ['affix' => 'рен', 'name' => 'исходный падеж'],
//             ['affix' => 'чен', 'name' => 'исходный падеж'],
//             ['affix' => 'шăн', 'name' => 'причинный (причинно-целевой) падеж'],
//             ['affix' => 'шĕн', 'name' => 'причинный (причинно-целевой) падеж'],
//             ['affix' => 'сăр', 'name' => 'лишительный падеж'],
//             ['affix' => 'сĕр', 'name' => 'лишительный падеж'],
//             ['affix' => 'нӑн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'нĕн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'ăнн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'ĕнн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'пала', 'name' => 'творительный падеж'],
//             ['affix' => 'пеле', 'name' => 'творительный падеж'],
//             ['affix' => 'танн', 'name' => 'исходный падеж'],
//             ['affix' => 'тенн', 'name' => 'исходный падеж'],
//             ['affix' => 'ранн', 'name' => 'исходный падеж'],
//             ['affix' => 'ренн', 'name' => 'исходный падеж'],
//             ['affix' => 'ченн', 'name' => 'исходный падеж'],
//             ['affix' => 'шăнн', 'name' => 'причинный (причинно-целевой) падеж'],
//             ['affix' => 'шĕнн', 'name' => 'причинный (причинно-целевой) падеж'],
//             ['affix' => 'сăрр', 'name' => 'лишительный падеж'],
//             ['affix' => 'сĕрр', 'name' => 'лишительный падеж'],
//             ['affix' => 'палан', 'name' => 'творительный падеж'],
//             ['affix' => 'пелен', 'name' => 'творительный падеж'],
//             ['affix' => 'паланн', 'name' => 'творительный падеж'],
//             ['affix' => 'пеленн', 'name' => 'творительный падеж'],
//         ],
//         // 7 и 8 ой это по сути один и тот же уровень,

//         5 => [
//             ['affix' => 'чен', 'name' => 'прошедшее время '],
//             ['affix' => 'ччен', 'name' => 'прошедшее время '],
//         ],
//         // для всех
//         6 => [
//             ['affix' => 'х', 'name' => 'прошедшее время '],
//         ],     //24 и 25 ой это по сути один и тот же уровень  
//         // для всех
//         6 => [
//             ['affix' => 'ах', 'name' => 'прошедшее время '],
//             ['affix' => 'ех', 'name' => 'прошедшее время '],
//         ],     //24 и 25 ой это по сути один и тот же уровень  
//         // для всех
//         7 => [
//             ['affix' => 'чӗ', 'name' => 'прошедшее время '],
//             ['affix' => 'ччӗ', 'name' => 'прошедшее время '],
//         ],
//         // для всех
//     ];



    //  последовательность следования аффиксов для числительных
    public const LEVELS_num = [
        5 => [
            ['affix' => 'м', 'name' => 'порядковая форма числительного'],
            ['affix' => 'н', 'name' => 'собирательная форма числительного'],
        ], // 5 и 6 ой это по сути один и тот же уровень 
        6 => [
            ['affix' => 'ар', 'name' => 'разделительная форма числительного'],
            ['affix' => 'ер', 'name' => 'разделительная форма числительного'],
            ['affix' => 'ăм', 'name' => 'порядковая форма числительного'],
            ['affix' => 'ĕм', 'name' => 'порядковая форма числительного'],
            ['affix' => 'ăн', 'name' => 'собирательная форма числительного'],
            ['affix' => 'ĕн', 'name' => 'собирательная форма числительного'],
            ['affix' => 'мĕш', 'name' => 'порядковая форма числительного'],
            ['affix' => 'шар', 'name' => 'разделительная форма числительного'],
            ['affix' => 'шер', 'name' => 'разделительная форма числительного'],
            ['affix' => 'сӑм', 'name' => '1-ое лицо числительного'],
            ['affix' => 'сӗм', 'name' => '1-ое лицо числительного'],


            // 5 и 6 ой это по сути один и тот же уровень 
        ],
        7 => [
            ['affix' => 'а', 'name' => 'дательный падеж'],
            ['affix' => 'е', 'name' => 'дательный падеж'],
            ['affix' => 'н', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'п', 'name' => 'творительный падеж'],
            ['affix' => 'р', 'name' => 'местный падеж '],
            ['affix' => 'т', 'name' => 'местный падеж'],
            ['affix' => 'ч', 'name' => 'местный падеж '],
        ], // 7 и 8 ой это по сути один и тот же уровень 
        8 => [
            ['affix' => 'нӑн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'нĕн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'на', 'name' => 'дательный падеж'],
            ['affix' => 'не', 'name' => 'дательный падеж'],
            ['affix' => 'ăн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'ĕн', 'name'    => 'притяжательный (родительный) падеж'],
            ['affix' => 'ăнн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'ĕнн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'нн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'па', 'name' => 'творительный падеж'],
            ['affix' => 'пе', 'name' => 'творительный падеж'],
            ['affix' => 'пала', 'name' => 'творительный падеж'],
            ['affix' => 'пеле', 'name' => 'творительный падеж'],
            ['affix' => 'пал', 'name' => 'творительный падеж'],
            ['affix' => 'пел', 'name' => 'творительный падеж'],
            ['affix' => 'палан', 'name' => 'творительный падеж'],
            ['affix' => 'пелен', 'name' => 'творительный падеж'],
            ['affix' => 'паланн', 'name' => 'творительный падеж'],
            ['affix' => 'пеленн', 'name' => 'творительный падеж'],
            ['affix' => 'ра', 'name' => 'местный падеж '],
            ['affix' => 'ре', 'name' => 'местный падеж '],
            ['affix' => 'та', 'name' => 'местный падеж '],
            ['affix' => 'те', 'name' => 'местный падеж '],
            ['affix' => 'че', 'name' => 'местный падеж '],
            ['affix' => 'ран', 'name' => 'исходный падеж '],
            ['affix' => 'рен', 'name' => 'исходный падеж '],
            ['affix' => 'тан', 'name' => 'исходный падеж '],
            ['affix' => 'тен', 'name' => 'исходный падеж '],
            ['affix' => 'чен', 'name' => 'исходный падеж '],
            ['affix' => 'ранн', 'name' => 'исходный падеж '],
            ['affix' => 'ренн', 'name' => 'исходный падеж '],
            ['affix' => 'танн', 'name' => 'исходный падеж '],
            ['affix' => 'тенн', 'name' => 'исходный падеж '],
            ['affix' => 'ченн', 'name' => 'исходный падеж '],
            ['affix' => 'сăр', 'name' => 'лишительный падеж'],
            ['affix' => 'сĕр', 'name' => 'лишительный падеж'],
            ['affix' => 'сăрр', 'name' => 'лишительный падеж '],
            ['affix' => 'сĕрр', 'name' => 'лишительный падеж '],
            ['affix' => 'шăн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'шĕн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'шăнн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'шĕнн', 'name' => 'причинный (причинно-целевой) падеж'],
            // 7 и 8 ой это по сути один и тот же уровень,
        ],

        23 => [
            ['affix' => 'чен', 'name' => 'прошедшее время '],
            ['affix' => 'ччен', 'name' => 'прошедшее время '],
        ],
        // для всех
        24 => [
            ['affix' => 'х', 'name' => 'прошедшее время '],
        ],     //24 и 25 ой это по сути один и тот же уровень  
        // для всех
        25 => [
            ['affix' => 'ах', 'name' => 'прошедшее время '],
            ['affix' => 'ех', 'name' => 'прошедшее время '],
        ],     //24 и 25 ой это по сути один и тот же уровень  
        // для всех

        26 => [
            ['affix' => 'ччӗ', 'name' => 'прошедшее время '],
            ['affix' => 'чӗ', 'name' => 'прошедшее время '],
        ],
        // для всех
    ];

    //  последовательность следования аффиксов для прилагательных
    public const LEVELS_adj = [

        4 => [
            ['affix' => 'лӑ', 'name' => 'аффикс обладания или наличия'],
            ['affix' => 'лӗ', 'name' => 'аффикс обладания или наличия'],
            ['affix' => 'ла', 'name' => 'аффикс уподобления'], // печӗкле, шуралла ,  хуралла, ҫаралла
            ['affix' => 'ле', 'name' => 'аффикс уподобления'],
            ['affix' => 'ӑн', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'ӗн', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'лӑх', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'лӗх', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'рах', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'рех', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'тарах', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'терех', 'name' => 'внепадежная форма обладания или наличности'],
            
        ],
        7 => [
            ['affix' => 'а', 'name' => 'дательный падеж'],
            ['affix' => 'е', 'name' => 'дательный падеж'],
            ['affix' => 'н', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'п', 'name' => 'творительный падеж'],
            ['affix' => 'р', 'name' => 'местный падеж '],
            ['affix' => 'т', 'name' => 'местный падеж'],
            ['affix' => 'ч', 'name' => 'местный падеж '],
        ], // 7 и 8 ой это по сути один и тот же уровень 
        8 => [
            ['affix' => 'на', 'name' => 'дательный падеж'],
            ['affix' => 'не', 'name' => 'дательный падеж'],
            ['affix' => 'ăн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'ĕн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'па', 'name' => 'творительный падеж'],
            ['affix' => 'пе', 'name' => 'творительный падеж'],
            ['affix' => 'ра', 'name' => 'местный падеж '],
            ['affix' => 'ре', 'name' => 'местный падеж '],
            ['affix' => 'та', 'name' => 'местный падеж '],
            ['affix' => 'те', 'name' => 'местный падеж '],
            ['affix' => 'че', 'name' => 'местный падеж '],
            ['affix' => 'нн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'нӑн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'нĕн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'пал', 'name' => 'творительный падеж'],
            ['affix' => 'пел', 'name' => 'творительный падеж'],
            ['affix' => 'ран', 'name' => 'исходный падеж '],
            ['affix' => 'рен', 'name' => 'исходный падеж '],
            ['affix' => 'тан', 'name' => 'исходный падеж '],
            ['affix' => 'тен', 'name' => 'исходный падеж '],
            ['affix' => 'чен', 'name' => 'исходный падеж '],
            ['affix' => 'сăр', 'name' => 'лишительный падеж'],
            ['affix' => 'сĕр', 'name' => 'лишительный падеж'],
            ['affix' => 'шăн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'шĕн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'ăнн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'ĕнн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'пала', 'name' => 'творительный падеж'],
            ['affix' => 'пеле', 'name' => 'творительный падеж'],
            ['affix' => 'ранн', 'name' => 'исходный падеж '],
            ['affix' => 'ренн', 'name' => 'исходный падеж '],
            ['affix' => 'танн', 'name' => 'исходный падеж '],
            ['affix' => 'тенн', 'name' => 'исходный падеж '],
            ['affix' => 'ченн', 'name' => 'исходный падеж '],
            ['affix' => 'сăрр', 'name' => 'лишительный падеж '],
            ['affix' => 'сĕрр', 'name' => 'лишительный падеж '],
            ['affix' => 'шăнн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'шĕнн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'палан', 'name' => 'творительный падеж'],
            ['affix' => 'пелен', 'name' => 'творительный падеж'],
            ['affix' => 'паланн', 'name' => 'творительный падеж'],
            ['affix' => 'пеленн', 'name' => 'творительный падеж'],
        ],
        23 => [
            ['affix' => 'чен', 'name' => 'аффикс предельности'],
            ['affix' => 'ччен', 'name' => 'аффикс предельности'],
        ],
        // для всех
        // 24 => [
        //     ['affix' => 'х', 'name' => 'аффикс усиления'],  // напрямую к основе не присоеднияются или после и, скер или после аффикса рах, рех, тарах , терех
        // ],     //24 и 25 ой это по сути один и тот же уровень  
        // для всех
        25 => [
            ['affix' => 'ах', 'name' => 'аффикс усиления'],
            ['affix' => 'ех', 'name' => 'аффикс усиления'], // напрямую к основе не присоеднияются или после и, скер или после аффикса рах, рех, тарах , терех
        ],     //24 и 25 ой это по сути один и тот же уровень  
        // для всех

        26 => [

            ['affix' => 'чӗ', 'name' => 'прошедшее время '],
            ['affix' => 'ччӗ', 'name' => 'прошедшее время '],
        ],
        // для всех
    ];

// как мне программно изобразить следующий граф
// вот есть три вершины A1,A2,A3 . От них идут с каждой вершиные вектора в вершины  B1,B2,B3. То есть из A1 могут идти 
// направленные ребра в B1,B2,B3 , аналогично и из A2,A3. Далее ребра идут из вершин    B1,B2,B3 в вершины C1,C2,C3 точно таким же образом.
// Как мне программно через библиотеку  graphp/graph описать следующее - если ни одна из A1,A2,A3 которые следуют в  B1,B2,B3 не 
//  сработала то надо проверять срабатывание из A1,A2,A3 в  C1,C2,C3 .

    //  последовательность следования аффиксов для наречий


    public const LEVELS_adv = [

        4 => [
            ['affix' => 'лӑ', 'name' => 'аффикс обладания или наличия'],
            ['affix' => 'лӗ', 'name' => 'аффикс обладания или наличия'],
            ['affix' => 'ла', 'name' => 'аффикс уподобления'],
            ['affix' => 'ле', 'name' => 'аффикс уподобления'],
            ['affix' => 'ӑн', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'ӗн', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'лӑх', 'name' => 'внепадежная форма обладания или наличности'],
            ['affix' => 'лӗх', 'name' => 'внепадежная форма обладания или наличности'],
        ],
        7 => [
            ['affix' => 'а', 'name' => 'дательный падеж'],
            ['affix' => 'е', 'name' => 'дательный падеж'],
            ['affix' => 'н', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'п', 'name' => 'творительный падеж'],
            ['affix' => 'р', 'name' => 'местный падеж '],
            ['affix' => 'т', 'name' => 'местный падеж'],
            ['affix' => 'ч', 'name' => 'местный падеж '],
        ], // 7 и 8 ой это по сути один и тот же уровень 
        8 => [
            ['affix' => 'на', 'name' => 'дательный падеж'],
            ['affix' => 'не', 'name' => 'дательный падеж'],
            ['affix' => 'ăн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'ĕн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'па', 'name' => 'творительный падеж'],
            ['affix' => 'пе', 'name' => 'творительный падеж'],
            ['affix' => 'ра', 'name' => 'местный падеж '],
            ['affix' => 'ре', 'name' => 'местный падеж '],
            ['affix' => 'та', 'name' => 'местный падеж '],
            ['affix' => 'те', 'name' => 'местный падеж '],
            ['affix' => 'че', 'name' => 'местный падеж '],
            ['affix' => 'нн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'нӑн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'нĕн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'пал', 'name' => 'творительный падеж'],
            ['affix' => 'пел', 'name' => 'творительный падеж'],
            ['affix' => 'ран', 'name' => 'исходный падеж '],
            ['affix' => 'рен', 'name' => 'исходный падеж '],
            ['affix' => 'тан', 'name' => 'исходный падеж '],
            ['affix' => 'тен', 'name' => 'исходный падеж '],
            ['affix' => 'чен', 'name' => 'исходный падеж '],
            ['affix' => 'сăр', 'name' => 'лишительный падеж'],
            ['affix' => 'сĕр', 'name' => 'лишительный падеж'],
            ['affix' => 'шăн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'шĕн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'ăнн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'ĕнн', 'name' => 'притяжательный (родительный) падеж'],
            ['affix' => 'пала', 'name' => 'творительный падеж'],
            ['affix' => 'пеле', 'name' => 'творительный падеж'],
            ['affix' => 'ранн', 'name' => 'исходный падеж '],
            ['affix' => 'ренн', 'name' => 'исходный падеж '],
            ['affix' => 'танн', 'name' => 'исходный падеж '],
            ['affix' => 'тенн', 'name' => 'исходный падеж '],
            ['affix' => 'ченн', 'name' => 'исходный падеж '],
            ['affix' => 'сăрр', 'name' => 'лишительный падеж '],
            ['affix' => 'сĕрр', 'name' => 'лишительный падеж '],
            ['affix' => 'шăнн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'шĕнн', 'name' => 'причинный (причинно-целевой) падеж'],
            ['affix' => 'палан', 'name' => 'творительный падеж'],
            ['affix' => 'пелен', 'name' => 'творительный падеж'],
            ['affix' => 'паланн', 'name' => 'творительный падеж'],
            ['affix' => 'пеленн', 'name' => 'творительный падеж'],
        ],


        23 => [
            ['affix' => 'чен', 'name' => 'прошедшее время '],
            ['affix' => 'ччен', 'name' => 'прошедшее время '],
        ],
        // для всех
        24 => [
            ['affix' => 'х', 'name' => 'прошедшее время '],
        ],     //24 и 25 ой это по сути один и тот же уровень  
        // для всех
        25 => [
            ['affix' => 'ах', 'name' => 'прошедшее время '],
            ['affix' => 'ех', 'name' => 'прошедшее время '],
        ],     //24 и 25 ой это по сути один и тот же уровень  
        // для всех

        26 => [

            ['affix' => 'чӗ', 'name' => 'прошедшее время '],
            ['affix' => 'ччӗ', 'name' => 'прошедшее время '],

        ],
        // для всех
    ];


    //  омонимичные аффиксы - и ,'ăн''ӗн', 
  
//   Предложи решение следующей проблемы. Допустим нам надо проанализировать слово вулӑп. 
//     у нас в словаре DICT.txt находятся два слова - вулӑ - существительное , вула - глагол.
//     Программа найдет наибольшую основу это вулӑ , но для существительных программа не найдет аффикса в массиве  $affixLevels_noun.
//     То есть вариант с тем что это существительное отпадает если есть какие то неизвезтные аффиксы после анализа.
//     Правильным будет вариант следущий - основа 'вула', а аффикс 'ӑп'.  
//     Чаще все выпадают на конце слова гласные ӗ,ӑ,у,ӳ,а ,о,я (ы,и не выпадают),  и к основне присоединяются вместо них аффиксы.  
//     Вобщем две глобальные проблемы:
//     1. Как выявить основы в словаре если во многих словах у них конечные гласные выпадают.
//     2. Как сделать анализ по всем вариантам основы в словаре для анализируемого слова. 



    //  последовательность следования аффиксов для причастий д
    // для причастий последовательность следования аффиксов как для глаголов



    // //  скер, и ко всем частям речи
    // 1)ӑр,ӗр,ăм,ĕм,м,ĕ,у,ӳ,шĕ    к существительным
    //     -ăм (-ĕм, -м) форма 1-го лица принадлежности 
    //     -ăр (-ĕр) форма множественного числа (1-го и 2-го лица) принадлежности (к существительным) 
    //     -ĕ (-и) форма 3-го лица принадлежности 
    //     -у (-ӳ, диал. -ă, -ĕ) форма 2-го лица единственного числа принадлежности 
    //     -(ш)ĕ 3-е лицо принадлежности

    // 2)сам, сем     для существительных
    // 3)лӑ,лӗ, ла, ле,ӑн,ӗн,лӑх,лӗх,         внепадежная форма обладания или наличности к существительным прилагательным и к наречиям и к причастиям
    //       ӑн,ӗн образа или способа действия
    //       лӑ,лӗ - обладания или наличия
    //        ла, ле уподобления

    // 4)ар,ер,ăм,ĕм,м,ăн,ĕн,н,мĕш,шар,шер         присоединяются к числительным  // 21 слово числительных всего
    // -ар (-ер) разделительная форма (числит.)
    // -ăм (-ĕм, -м) порядковая форма, устарелое (числит.)
    // -ăн (-ĕн, -н) собирательная форма (числит.)
    // -мĕш порядковая форма (числит.) 
    // -шар (-шер) разделительная форма (числит.) 

    // 5)а, е,ăн,ĕн,н,ин,ăнн,ĕнн,нн,нăн,нĕн,па,пе,п,пала,пеле,пал,пел,палан,пелен,паланн,пеленн,ра,ре,та,те,че,р,т,ч,ран,рен,тан,тен,чен,ранн,ренн,танн,тенн,ченн,сăр,сĕр,сăрр,сĕрр,шăн,шĕн,шăнн,шĕнн  ко всем частям речи
    //     -а (-е) дательный падеж
    //     -ăн (-ĕн, -н, -ăнн, -ĕнн, -нн) притяжательный (родительный) падеж 
    //     -нăн (-нĕн) притяжательный падеж, устарелое (то же, что -ăн (-ĕн)) 
    //     -па (-пе, -п, -пала, -пеле, -пал, -пел, -палан, -пелен, -паланн-, пеленн-) творительный падеж 
    //     -ра (-ре, -та, -те, -че, -р, -т, -ч) местный падеж 
    //     -ран (-рен, -тан, -тен, -чен, -ранн, -ренн, -танн, -тенн, -ченн) исходный падеж 
    //     -сăр (-сĕр, -сăрр, -сĕрр) лишительный падеж 
    //     -шăн (-шĕн, -шăнн, -шĕнн) причинный (причинно-целевой) падеж
    // //  скер, и ко всем частям речи

    // 6)рах, рех, тарах, терех, рахх, рехх, тарахх, терехх ,тар,тер, ттар ,ттер,тар, тер,ттар,ттер,ар,ер,ăн,ĕн,ăл,ĕл,ăç,ĕç,ç,ăш,ĕш,аш, еш,ç,ш   для глаголов
    //    -рах (-рех, -тарах, -терех, -рахх, -рехх, -тарахх, -терехх) сравнительная форма (компаратив)  для прилагательных , существительных(несколько), наречий и  глагол(значение приблизительности в некоторых контекстах)
    //    -тар (-тер), -ттар (-ттер) понудительный залог / понудительная (каузативная) форма глагола
    //    -ар (-ер) понудительный залог / понудительная  форма глагола 
    //    -ăн (-ĕн) -ăл (-ĕл)  возвратно страдательный залог к глаголам
    //    -ăç (-ĕç, -ç) [залог взаимный] взаимно совместный залог
    //    -ăш (-ĕш) аш еш [залог взаимный] взаимно совместный залог
    //    -ç -ш    взаимно совместный залог

    // 7)ай, ей, й, ăтт, ĕтт, тт    для глаголов
    // -ай (-ей, -й, диал. -и) желательное наклонение
    // -ăтт (-ĕтт, -тт) [сослагательное наклонение] будущее условное время глагола: -ă (-ĕ) (будущее время) + -ттă (-ттĕ, -чч) 

    // 8)ма,ме,м,мас,мес    для глаголов
    // -ма (-ме, -м) отрицательная форма (глаголов)
    // -мас (-мес) отрицательная форма 

    // 9)ат,ет,ă,ĕ,ăтт,ĕтт,тт, ттă,ттĕ,кала,келе,р,т,рă,рĕ,тă,тĕ,ч,сатт,сетт,т,тă,ч,тт,ттă,ттĕ,    для глаголов
    // -ат (-ет) настоящее время
    // -ă (-ĕ) будущее время
    // -ăтт (-ĕтт, -тт) [сослагательное наклонение]  
    // -кала (-келе) многократность (многократное время) (учащительная форма) 
    // -р (-т, -рă, -рĕ, -тă, -тĕ, -ч) прошедшее время глагола 
    // -сатт (-сетт) прошедшее время глагола
    // -т (-тă, -ч, -тт, ) прошедшее время глагола 
    // -тă (-тĕ, -рă, -рĕ, -р, -ч) прошедшее однократное время глагола
    // -ттă (-ттĕ, ) будущем условное времени глагола

    // 10) и,акан,екен,кан,кен,аканн,екенн,канн,кенн,ан,ен,анçи,енçи,ас,ес,с,асс,есс,сс,малăх,мелĕх,малла,мелле,малл,мелл,нă,нĕ,н к глаголам                          
    // -и причастие возможности  
    // -акан (-екен, -кан, -кен, -аканн, -екенн, -канн, -кенн) причастие настоящее время 
    // -ан (-ен, -н) причастие настоящее время
    // -анçи (-енçи) причастие
    // -ас (-ес, -с, -асс, -есс, -сс) причастие будущее время
    // -малăх (-мелĕх) причастие 
    // -малла (-мелле, -малл, -мелл) причастие долж. или повел. 
    // -нă (-нĕ, -н) причастие прошедшего времени (прошедшее неопределенное время глагола) 

    // 10) иччен,а,е,массерен,мессерен,нăранпа,нĕренпе,нăçем,нĕçем,нăçемĕн,ĕçемĕн,са,се,сан,сен,сассăн,сессĕн,çем,çем,ĕн,уçăн,ӳçĕн к глаголам
    // -иччен деепричастие 
    // -а (-е) деепричастие 
    // -массерен(-мессерен) деепричастие
    // -нăранпа (-нĕренпе) деепричастие
    // -нăçем (-нĕçем), -нăçемĕн (-ĕçемĕн) деепричастие
    // -са (-се) деепричастие 
    // -сан (-сен) деепричастие 
    // -сассăн (-сессĕн) деепричастие
    // -çем (-çем-ĕн) деепричастие
    // -уçăн (-ӳçĕн) деепричастие

    // 10) ма, ме, м , машкӑн, мешкӗн    
    //   -ма (-ме, -м, ) инфинитив 
    //    машкӑн, мешкӗн          инфинитив

    // 11) ах, ех, х, Any
    // 12) чен ччен Any  ///
    // 13) ччӗ, чӗ  Any  -чĕ (-ччĕ) прошедшее время 
}




// noun (n) - существительное
// verb (v) - глагол
//  adv  - наречие

// part - причастие
// adj (adjective) - прилагательное
// descr (descriptive) - имитативы (подражательное слово)
// int (interjection) - междометие
// pron (pronoun) - местоимение
// num - числительное



// Список аффиксов по уровням.
//  Сначала к основе присоединяются аффиксы 1-го уровня, потом 2- го и так далее.
// Запись '5 и 6 ой это по сути один и тот же уровень'  означает что в 5-ый уровень 
// включены аффиксы содержащие только один символ, а в 6 ом уровень находятся по сути аффиксы того же уровня, 
// но содержащие несколько символов. 
// Это сделано для того чтобы программа сначала искала в слове аффиксы более длинные(6 го уровня) а потом аффиксы из одного символа, 
// иначе мы найдем аффиксы из одного символа и останутся неразобранные части слова.
//  В конце уровней даются комменатрии типа -  '//  к существительным' - что означает что данные аффиксы выше присоединяются 
//  только к существительным.
//         1 => [
//             ['affix' => 'м', 'name' => 'форма 1-го лица принадлежности существительных'],
//             ['affix' => 'ĕ', 'name' => 'форма 3-го лица принадлежности принадлежности существительных'],
//             ['affix' => 'и', 'name' => 'форма 3-го лица принадлежности существительных'],
//             ['affix' => 'у', 'name' => 'форма 2-го лица единственного числа принадлежности существительных'],
//             ['affix' => 'ӳ', 'name' => 'форма 2-го лица единственного числа принадлежности существительных'],
//             ['affix' => 'ĕ', 'name' => 'форма 3-е лица принадлежности существительных'],
//         ],
//         2 => [
//             ['affix' => 'ӑр', 'name' => 'форма множественного числа (1-го и 2-го лица) принадлежности существительных'],
//             ['affix' => 'ӗр', 'name' => 'форма множественного числа (1-го и 2-го лица) принадлежности существительных'],
//             ['affix' => 'ăм', 'name' => 'форма 1-го лица принадлежности существительных'],
//             ['affix' => 'ĕм', 'name' => 'форма 1-го лица принадлежности существительных'],
//             ['affix' => 'шĕ', 'name' => 'форма 3-е лица принадлежности существительных'],
//         ],
//         //  к существительным
//         3 => [
//             ['affix' => 'сам', 'name' => 'форма множественного числа существительных'],
//             ['affix' => 'сем', 'name' => 'форма множественного числа существительных'],
//             ['affix' => 'сен', 'name' => 'форма множественного числа существительных'],
//             // ['affix' => 'се', 'name' => 'форма множественного числа существительных'],
//         ],
//         // сам, сем ,сен    для существительных
//         4 => [
//             ['affix' => 'лӑ', 'name' => 'аффикс обладания или наличия'],
//             ['affix' => 'лӗ', 'name' => 'аффикс обладания или наличия'],
//             ['affix' => 'ла', 'name' => 'аффикс уподобления'],
//             ['affix' => 'ле', 'name' => 'аффикс уподобления'],
//             ['affix' => 'ӑн', 'name' => 'внепадежная форма обладания или наличности'],
//             ['affix' => 'ӗн', 'name' => 'внепадежная форма обладания или наличности'],
//             ['affix' => 'лӑх', 'name' => 'внепадежная форма обладания или наличности'],
//             ['affix' => 'лӗх', 'name' => 'внепадежная форма обладания или наличности'],
//         ],
//         // для существительных, прилагательных, наречий, причастий

//         5 => [
//             ['affix' => 'м', 'name' => 'порядковая форма числительного'],
//             ['affix' => 'н', 'name' => 'собирательная форма числительного'],
//         ], // 5 и 6 ой это по сути один и тот же уровень 
//         6 => [
//             ['affix' => 'ар', 'name' => 'разделительная форма числительного'],
//             ['affix' => 'ер', 'name' => 'разделительная форма числительного'],
//             ['affix' => 'ăм', 'name' => 'порядковая форма числительного'],
//             ['affix' => 'ĕм', 'name' => 'порядковая форма числительного'],
//             ['affix' => 'ăн', 'name' => 'собирательная форма числительного'],
//             ['affix' => 'ĕн', 'name' => 'собирательная форма числительного'],
//             ['affix' => 'мĕш', 'name' => 'порядковая форма числительного'],
//             ['affix' => 'шар', 'name' => 'разделительная форма числительного'],
//             ['affix' => 'шер', 'name' => 'разделительная форма числительного'],
//              // 5 и 6 ой это по сути один и тот же уровень 
//         ],
//         //  для числительных
//         7 => [
//             ['affix' => 'а', 'name' => 'дательный падеж'],
//             ['affix' => 'е', 'name' => 'дательный падеж'],
//             ['affix' => 'н', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'п', 'name' => 'творительный падеж'],
//             ['affix' => 'р', 'name' => 'местный падеж '],
//             ['affix' => 'т', 'name' => 'местный падеж'],
//             ['affix' => 'ч', 'name' => 'местный падеж '],
//         ], // 7 и 8 ой это по сути один и тот же уровень 
//         8 => [
//             ['affix' => 'нӑн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'нĕн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'на', 'name' => 'дательный падеж'],
//             ['affix' => 'не', 'name' => 'дательный падеж'],
//             ['affix' => 'ăн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'ĕн', 'name'    => 'притяжательный (родительный) падеж'],
//             ['affix' => 'ăнн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'ĕнн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'нн', 'name' => 'притяжательный (родительный) падеж'],
//             ['affix' => 'па', 'name' => 'творительный падеж'],
//             ['affix' => 'пе', 'name' => 'творительный падеж'],
//             ['affix' => 'пала', 'name' => 'творительный падеж'],
//             ['affix' => 'пеле', 'name' => 'творительный падеж'],
//             ['affix' => 'пал', 'name' => 'творительный падеж'],
//             ['affix' => 'пел', 'name' => 'творительный падеж'],
//             ['affix' => 'палан', 'name' => 'творительный падеж'],
//             ['affix' => 'пелен', 'name' => 'творительный падеж'],
//             ['affix' => 'паланн', 'name' => 'творительный падеж'],
//             ['affix' => 'пеленн', 'name' => 'творительный падеж'],
//             ['affix' => 'ра', 'name' => 'местный падеж '],
//             ['affix' => 'ре', 'name' => 'местный падеж '],
//             ['affix' => 'та', 'name' => 'местный падеж '],
//             ['affix' => 'те', 'name' => 'местный падеж '],
//             ['affix' => 'че', 'name' => 'местный падеж '],
//             ['affix' => 'ран', 'name' => 'исходный падеж '],
//             ['affix' => 'рен', 'name' => 'исходный падеж '],
//             ['affix' => 'тан', 'name' => 'исходный падеж '],
//             ['affix' => 'тен', 'name' => 'исходный падеж '],
//             ['affix' => 'чен', 'name' => 'исходный падеж '],
//             ['affix' => 'ранн', 'name' => 'исходный падеж '],
//             ['affix' => 'ренн', 'name' => 'исходный падеж '],
//             ['affix' => 'танн', 'name' => 'исходный падеж '],
//             ['affix' => 'тенн', 'name' => 'исходный падеж '],
//             ['affix' => 'ченн', 'name' => 'исходный падеж '],
//             ['affix' => 'сăр', 'name' => 'лишительный падеж'],
//             ['affix' => 'сĕр', 'name' => 'лишительный падеж'],
//             ['affix' => 'сăрр', 'name' => 'лишительный падеж '],
//             ['affix' => 'сĕрр', 'name' => 'лишительный падеж '],
//             ['affix' => 'шăн', 'name' => 'причинный (причинно-целевой) падеж'],
//             ['affix' => 'шĕн', 'name' => 'причинный (причинно-целевой) падеж'],
//             ['affix' => 'шăнн', 'name' => 'причинный (причинно-целевой) падеж'],
//             ['affix' => 'шĕнн', 'name' => 'причинный (причинно-целевой) падеж'],
//              // 7 и 8 ой это по сути один и тот же уровень,
//         ],
//         // ко всем частям речи
//         9 => [
//             ['affix' => 'ç', 'name' => 'взаимно совместный залог глагола'],
//             ['affix' => 'ш', 'name' => 'взаимно совместный залог глагола'],
//               // 9 и 10 ой это по сути один и тот же уровень,  
//         ],
//         10 => [
//             ['affix' => 'рах', 'name' => 'сравнительная форма (компаратив) глагола'],
//             ['affix' => 'рех', 'name' => 'сравнительная форма (компаратив) глагола'],
//             ['affix' => 'тарах', 'name' => 'сравнительная форма (компаратив) глагола'],
//             ['affix' => 'терех', 'name' => 'сравнительная форма (компаратив) глагола'],
//             ['affix' => 'тарахх', 'name' => 'сравнительная форма (компаратив) глагола'],
//             ['affix' => 'терехх', 'name' => 'сравнительная форма (компаратив) глагола'],
//             ['affix' => 'тар', 'name' => 'понудительный залог глагола'],
//             ['affix' => 'тер', 'name' => 'понудительный залог глагола'],
//             ['affix' => 'ттар', 'name' => 'понудительный залог глагола'],
//             ['affix' => 'ттер', 'name' => 'понудительный залог глагола'],
//             ['affix' => 'ар', 'name' => 'понудительный залог глагола'],
//             ['affix' => 'ер', 'name' => 'понудительный залог глагола'],
//             ['affix' => 'ăн', 'name' => 'возвратно страдательный залог глагола'],
//             ['affix' => 'ĕн', 'name' => 'возвратно страдательный залог глагола'],
//             ['affix' => 'ăл', 'name' => 'возвратно страдательный залог глагола'],
//             ['affix' => 'ĕл', 'name' => 'возвратно страдательный залог глагола'],
//             ['affix' => 'ăç', 'name' => 'взаимно совместный залог глагола'],
//             ['affix' => 'ĕç', 'name' => 'взаимно совместный залог глагола'],
//             ['affix' => 'ăш', 'name' => 'взаимно совместный залог глагола'],
//             ['affix' => 'ĕш', 'name' => 'взаимно совместный залог глагола'],
//             ['affix' => 'аш', 'name' => 'взаимно совместный залог глагола'],
//             ['affix' => 'еш', 'name' => 'взаимно совместный залог глагола'],
//              // 9 и 10 ой это по сути один и тот же уровень,
//         ],
//         // для глаголов
//         11 => [
//             ['affix' => 'й', 'name' => 'желательное наклонение глаголов'],
//              // 11 и 12 это по сути один и тот же уровень,
//         ],

//         12 => [
//             ['affix' => 'ай', 'name' => 'желательное наклонение глаголов'],
//             ['affix' => 'ей', 'name' => 'желательное наклонение глаголов'],
//             ['affix' => 'ăтт', 'name' => '[сослагательное наклонение] будущее условное время глагола'],
//             ['affix' => 'ĕтт', 'name' => '[сослагательное наклонение] будущее условное время глагола'],
//             ['affix' => 'тт', 'name' => '[сослагательное наклонение] будущее условное время глагола'],
//              // 11 и 12 это по сути один и тот же уровень,
//         ],
//         // для глаголов
//         13 => [
//             ['affix' => 'м', 'name' => 'отрицательная форма глаголов'],
//              //13 и 14 ой это по сути один и тот же уровень 
//         ],
//         14 => [
//             ['affix' => 'ма', 'name' => 'отрицательная форма глаголов'],
//             ['affix' => 'ме', 'name' => 'отрицательная форма глаголов'],
//             ['affix' => 'мас', 'name' => 'отрицательная форма глаголов'],
//             ['affix' => 'мес', 'name' => 'отрицательная форма глаголов'],
//              //13 и 14 ой это по сути один и тот же уровень 
//         ],
//         // для глаголов
//         15 => [
//             ['affix' => 'ă', 'name' => 'будущее время'],
//             ['affix' => 'ĕ', 'name' => 'будущее время'],
//             ['affix' => 'р', 'name' => 'прошедшее время глагола'],
//             ['affix' => 'т', 'name' => 'прошедшее время глагола'],
//             ['affix' => 'ч', 'name' => 'прошедшее время глагола '],
//              //15 и 16 ой это по сути один и тот же уровень 
//         ],
//         16 => [
//             ['affix' => 'ат', 'name' => 'настоящее время глагола'],
//             ['affix' => 'ать', 'name' => 'настоящее время глагола'],
//             ['affix' => 'ет', 'name' => 'настоящее время глагола'],
//             ['affix' => 'ăтт', 'name' => 'сослагательное наклонение глагола'],
//             ['affix' => 'ĕтт', 'name' => 'сослагательное наклонение глагола'],
//             ['affix' => 'тт', 'name' => 'сослагательное наклонение глагола'],
//             ['affix' => 'ттă', 'name' => ' будущем условное времени глагола'],
//             ['affix' => 'ттĕ', 'name' => ' будущем условное времени глагола'],
//             ['affix' => 'чч', 'name' => '???????????'],
//             ['affix' => 'кала', 'name' => 'многократность (многократное время) (учащительная форма) глагола'],
//             ['affix' => 'келе', 'name' => 'многократность (многократное время) (учащительная форма) глагола'],
//             ['affix' => 'рă', 'name' => 'прошедшее время глагола'],
//             ['affix' => 'рĕ', 'name' => 'прошедшее время глагола'],
//             ['affix' => 'тă', 'name' => 'прошедшее однократное время глагола'],
//             ['affix' => 'тĕ', 'name' => 'прошедшее однократное время глагола'],
//             ['affix' => 'сатт', 'name' => 'прошедшее время глагола'],
//             ['affix' => 'сетт', 'name' => 'прошедшее время глагола'],
//              //15 и 16 ой это по сути один и тот же уровень 
//         ],
//         // для глаголов
//         17 => [
//             ['affix' => 'и', 'name' => 'причастие возможности для глаголов'],
//             ['affix' => 'с', 'name' => 'причастие будущее время для глаголов'],
//             ['affix' => 'н', 'name' => 'причастие настоящее время для глаголов'], //???????????? здесь н выступает еще как причастие прошедшего времени (прошедшее неопределенное время глагола)
//              //17 и 18 ой это по сути один и тот же уровень
//         ],
//         18 => [
//             ['affix' => 'акан', 'name' => 'причастие настоящее время '],
//             ['affix' => 'екен', 'name' => 'причастие настоящее время '],
//             ['affix' => 'аканн', 'name' => 'причастие настоящее время '],
//             ['affix' => 'екенн', 'name' => 'причастие настоящее время '],
//             ['affix' => 'кан', 'name' => 'причастие настоящее время '],
//             ['affix' => 'кен', 'name' => 'причастие настоящее время '],
//             ['affix' => 'канн', 'name' => 'причастие настоящее время '],
//             ['affix' => 'кенн', 'name' => 'причастие настоящее время '],
//             ['affix' => 'ан', 'name' => 'причастие настоящее время'],
//             ['affix' => 'ен', 'name' => 'причастие настоящее время'],
//             ['affix' => 'анçи', 'name' => 'причастие'],
//             ['affix' => 'енçи', 'name' => 'причастие'],
//             ['affix' => 'ас', 'name' => 'причастие будущее время'],
//             ['affix' => 'ес', 'name' => 'причастие будущее время'],
//             ['affix' => 'асс', 'name' => 'причастие будущее время'],
//             ['affix' => 'есс', 'name' => 'причастие будущее время'],
//             ['affix' => 'сс', 'name' => 'причастие будущее время'],
//             ['affix' => 'малăх', 'name' => 'причастие'],
//             ['affix' => 'мелĕх', 'name' => 'причастие'],
//             ['affix' => 'малла', 'name' => 'причастие долженствовательное или повелительное'],
//             ['affix' => 'мелле', 'name' => 'причастие долженствовательное или повелительное'],
//             ['affix' => 'малл', 'name' => 'причастие долженствовательное или повелительное'],
//             ['affix' => 'мелл', 'name' => 'причастие долженствовательное или повелительное'],
//             ['affix' => 'нă', 'name' => 'причастие прошедшего времени (прошедшее неопределенное время глагола) '],
//             ['affix' => 'нĕ', 'name' => 'причастие прошедшего времени (прошедшее неопределенное время глагола) '],
//         ],     //17 и 18 ой это по сути один и тот же уровень
//         // для глаголов
//         19 => [
//             ['affix' => 'а', 'name' => 'деепричастие'],
//             ['affix' => 'е', 'name' => 'деепричастие'],
//         ],
//         20 => [
//             ['affix' => 'иччен', 'name' => 'деепричастие'],
//             ['affix' => 'массерен', 'name' => 'деепричастие'],
//             ['affix' => 'мессерен', 'name' => 'деепричастие'],
//             ['affix' => 'нăранпа', 'name' => 'деепричастие'],
//             ['affix' => 'нĕренпе', 'name' => 'деепричастие'],
//             ['affix' => 'нăçем', 'name' => 'деепричастие'],
//             ['affix' => 'нĕçем', 'name' => 'деепричастие'],
//             ['affix' => 'нăçемĕн', 'name' => 'деепричастие'],
//             ['affix' => 'ĕçемĕн', 'name' => 'деепричастие'],
//             ['affix' => 'са', 'name' => 'деепричастие'],
//             ['affix' => 'се', 'name' => 'деепричастие'],
//             ['affix' => 'сан', 'name' => 'деепричастие'],
//             ['affix' => 'сен', 'name' => 'деепричастие'],
//             ['affix' => 'сассăн', 'name' => 'деепричастие'],
//             ['affix' => 'сессĕн', 'name' => 'деепричастие'],
//             ['affix' => 'çем', 'name' => 'деепричастие'],
//             ['affix' => 'ĕн', 'name' => 'деепричастие'],
//             ['affix' => 'уçăн', 'name' => 'деепричастие'],
//             ['affix' => 'ӳçĕн', 'name' => 'деепричастие'],
//         ],
//         // для глаголов
//         21 => [['affix' => 'м', 'name' => 'инфинитив'],],
//         // для глаголов
//         22 => [
//             ['affix' => 'ма', 'name' => 'инфинитив'],
//             ['affix' => 'ма', 'name' => 'инфинитив'],
//         ],
//         // для глаголов
//         // 10) ма, ме, м , машкӑн, мешкӗн    
//         //   -ма (-ме, -м, ) инфинитив 
//         //    машкӑн, мешкӗн          инфинитив
//         23 => [
//             ['affix' => 'х', 'name' => 'прошедшее время '],
//         ],     //23 и 24 ой это по сути один и тот же уровень  
//         // для всех
//         24 => [
//             ['affix' => 'ах', 'name' => 'прошедшее время '],
//             ['affix' => 'ех', 'name' => 'прошедшее время '],
//         ],     //23 и 24 ой это по сути один и тот же уровень  
//         // для всех
//         25 => [
//             ['affix' => 'чен', 'name' => 'прошедшее время '],
//             ['affix' => 'ччен', 'name' => 'прошедшее время '],
//         ],     //23 и 24 ой это по сути один и тот же уровень                
//         // // для всех
//         26 => [
//             ['affix' => 'ччӗ', 'name' => 'прошедшее время '],
//             ['affix' => 'чӗ', 'name' => 'прошедшее время '],
//         ],
//         // для всех

//     ];