<?php
return [
    // главная панель
    'header1' => 'Электронный корпус чувашского языка',
    'header2' => 'Чувашский государственный институт гуманитарных наук',
    'home' => 'Главная',
    'home2' => 'Информация о базе данных',
    'home3' => 'Обзор базы данных',
    'home4' => 'Последние добавления',
    'home5' => 'Поиск',
    'home6' => 'Морфологический анализ',
    //  админ панель
    'admin' =>      'Админ',
    'admin1' =>     'Заполнение базы дынных',
    'admin2' =>     'Фильтрация',
    'admin3' =>     'Считать и записать в .ENV статистику',
    'admin4' =>     'Редактирование статей',
    // категории
    'Category' =>   'Категория',
    'Category1' =>  'Научно-популярные тексты',
    'Category2' =>  'Литература',
    'Category3' =>  'Прозаические тексты',
    'Category4' =>  'Поэтические тексты',
    'Category5' =>  'Драматургия',
    'Category6' =>  'Публицистические тексты',
    'Category7' =>  'Устное народное творечество',
    'Category8' =>  'Официально-деловые тексты',
    'Category9' =>  'Интернет-ресурсы',
    'Category10' => 'Религия',
    'Category11' => 'Христианство',
    'Category12' => 'Мусульманство',
    'Category13' => 'Буддизм',
    'Category14' => 'Не определена',
    // жанры
    'Genre'   =>  'Жанр',
    'Genre1'   => 'Повесть',
    'Genre2'   => 'Рассказ',
    'Genre3'   => 'Роман',
    'Genre4'   => 'Очерк',
    'Genre5'   => 'Новелла',
    'Genre6'   => 'Фельетон',
    'Genre7'   => 'Поэма',
    'Genre8'   => 'Стихотворение',
    'Genre9'   => 'Пьеса',
    'Genre10'   => 'Драма',
    'Genre11'   => 'Комедия',
    'Genre12'   => 'Трагедия',
    'Genre13'   => 'Басня',
    'Genre14'   =>  'Сказка',
     'Genre15'   =>  'Песня',
    'Genre16'   =>  'Частушка',
    'Genre17'   =>  'Предисловие',
    'Genre18'   =>  'Мемуарная и эпистолярная литература',
    'Genre19'   =>  'Баллада',
     'Genre20'   =>  'Сонет',
     'Genre21'   =>  'Быль',
     'Genre22'   =>  'Эссе',
     'Genre23'   =>  'Рецензия,отзыв',
     'Genre24'   =>  'Романс',
     'Genre25'   =>  'Монолог',
     'Genre26'   =>  'Автобиография',
     'Genre27'   =>  'Сценка',
     'Genre28'   =>  'Инсценировка',
     'Genre29'   =>  'Рапсодия',
     'Genre30'   =>  'Памфлет',
     'Genre31'   =>  'Трагикомедия',
     'Genre32'   =>  'Эскиз',
     'Genre33'   =>  'Зарисовка',
     'Genre34'   =>  'Не определен',






  
   // паралелльный подкорпус
   'Parallel' => 'Параллельный подкорпус',
   'Parallel1' => 'Добавление в базу данных',
   'Parallel2' => 'Фильтрация в подкорпусе',
   'Parallel3' => 'Обзор параллельного подкорпуса',
   'Parallel4' => 'Последние добавления',
   'Parallel5' => 'Поиск в подкорпусе',

   // регистрация 

   'Registration'   =>  'Регистрация',
   'Login'         =>   'Вход',
   'Welcome'        =>   'Добро пожаловать',
   'Logout'         =>   'Выйти',
];

