<?php
return [
    'header1' => 'Чӑваш чӗлхин наци корпусӗ',
    'header2' => 'Чӑваш патшалӑх гуманитари ӑслӑлӑхӗсен институчӗ',
    'home' => 'Тӗп',
    'home2' => 'Даннӑйсен бази ҫинчен калакан информаци',
    'home3' => 'Даннӑйсен никӗсӗ',
    'home4' => 'Юлашки хушса ҫырнисем',
    'home5' => 'Шырав',

     //  админ панель
     'admin' => 'Админ',
     'admin1' => 'Пӗлемсем пуххине тӳшкерни',
     'admin2' => 'Фильтраци',
     // категории
     'Category' => 'Категори',
     'Category1' =>  'Наукӑпа популярлӑ текстсем',
     'Category2' =>  'Литература',
     'Category3' =>  'Проза тексчӗсем',
     'Category4' =>  'Поэзи тексчӗсем',
     'Category5' =>  'Драматурги',
     'Category6' =>  'Публицистика тексчӗсем',
     'Category7' => 'Халӑх пултарулӑхӗ',
     'Category8' => 'Официаллӑ ӗҫ тексчӗсем',
     'Category9' => 'Интернет-ресурссем',
     'Category10' =>  'Тӗн',
     'Category11' =>  'Христианлӑх',
     'Category12' =>  'Мусульманлӑх',
     'Category13' =>  'Буддизм',
     'Category14' =>  'Паллӑ мар',
     // жанры
     'Genre'   =>  'Жанр',
     'Genre1'   => 'Повесть',
     'Genre2'   => 'Калав',
     'Genre3'   => 'Роман',
     'Genre4'   => 'Очерк',
     'Genre5'   => 'Новелла',
     'Genre6'   => 'Фельетон',
     'Genre7'   => 'Поэма',
     'Genre8'   => 'Сӑвӑ',
     'Genre9'   => 'Пьеса',
     'Genre10'   => 'Драма',
     'Genre11'   => 'Комеди',
     'Genre12'   => 'Трагеди',
     'Genre13'   => 'Юптару',
     'Genre14'   =>  'Юмах',
     'Genre15'   => 'Паллӑ мар',
    // паралелльный подкорпус
    'Parallel' => 'Параллеллӗ подкорпус',
    'Parallel1' => 'Даннӑйсен базине хушни',
    'Parallel2' => 'Корпусри фильтраци',
    'Parallel3' => 'Параллеллӗ корпус обзорӗ',
    'Parallel4' => 'Юлашки хушса ҫырнисем',
    'Parallel5' => 'Корпусри шырав',
 
    // регистрация 
 
    'Registration'   =>  'Регистраци',
    'Login'         =>   'Кӗмелли вырӑн',

];